####  Read the data given in both ratings and movies files.

In [77]:
import pandas as pd
movies = pd.read_csv("D:/DSA-M/ML with Python/projects/MOVIE-RECOMMENDATION/movies.csv")
ratings = pd.read_csv("D:/DSA-M/ML with Python/projects/MOVIE-RECOMMENDATION/ratings.csv")
display(movies.head())
display(ratings.head())

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [78]:
print(movies.shape)
print(ratings.shape)

(9742, 3)
(100836, 4)

#### Merge those datasets into one

In [79]:
merged=pd.merge(movies, ratings, on='movieId')
display(merged.head(10))

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1,4.0,964982703
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5,4.0,847434962
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7,4.5,1106635946
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15,2.5,1510577970
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17,4.5,1305696483
5,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,18,3.5,1455209816
6,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,19,4.0,965705637
7,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,21,3.5,1407618878
8,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,27,3.0,962685262
9,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,31,5.0,850466616

#### Extract columns with useful information

In [80]:
merged = merged[['movieId', 'title', 'userId', 'rating']]
display(merged.head(10))

   movieId             title  userId  rating
0        1  Toy Story (1995)       1     4.0
1        1  Toy Story (1995)       5     4.0
2        1  Toy Story (1995)       7     4.5
3        1  Toy Story (1995)      15     2.5
4        1  Toy Story (1995)      17     4.5
5        1  Toy Story (1995)      18     3.5
6        1  Toy Story (1995)      19     4.0
7        1  Toy Story (1995)      21     3.5
8        1  Toy Story (1995)      27     3.0
9        1  Toy Story (1995)      31     5.0

#### Generate a pivot table.

In [81]:
usertable=pd.pivot_table(merged, index=['userId'], values=['rating'], aggfunc=[len], margins=True)
usertable

             len
          rating
userId
1          232.0
2           29.0
3           39.0
4          216.0
5           44.0
...          ...
607        187.0
608        831.0
609         37.0
610       1302.0
All     100836.0

[611 rows x 1 columns]

In [82]:
import numpy as np

movietable=pd.pivot_table(merged, index=['title'], values=['rating'], aggfunc=[len, np.mean], margins=True)
movietable

                                                len      mean
                                             rating    rating
title
'71 (2014)                                      1.0  4.000000
'Hellboy': The Seeds of Creation (2004)         1.0  4.000000
'Round Midnight (1986)                          2.0  3.500000
'Salem's Lot (2004)                             1.0  5.000000
'Til There Was You (1997)                       2.0  4.000000
...                                             ...       ...
xXx (2002)                                     24.0  2.770833
xXx: State of the Union (2005)                  5.0  2.000000
¡Three Amigos! (1986)                          26.0  3.134615
À nous la liberté (Freedom for Us) (1931)       1.0  1.000000
All                                        100836.0  3.501557

[9720 rows x 2 columns]

In [83]:
print("UserId - Number of ratings provided")
merged['userId'].value_counts()

UserId - Number of ratings provided

414    2698
599    2478
474    2108
448    1864
274    1346
       ...
406      20
595      20
569      20
431      20
442      20
Name: userId, Length: 610, dtype: int64

In [84]:
print("MovieId - Number of ratings provided")
merged['movieId'].value_counts()

MovieId - Number of ratings provided

356       329
318       317
296       307
593       279
2571      278
         ...
5922        1
153386      1
57147       1
5986        1
8196        1
Name: movieId, Length: 9724, dtype: int64

In [85]:
print("Movies with ratings  > 4.0")
display(pd.unique(merged[merged.rating > 4.0]['title']))

Movies with ratings  > 4.0

array(['Toy Story (1995)', 'Jumanji (1995)', 'Grumpier Old Men (1995)',
       ..., 'Mamma Mia: Here We Go Again! (2018)',
       'The Man Who Killed Don Quixote (2018)', 'Gintama (2017)'],
      dtype=object)

#### Perform data cleaning by dropping users with less than 10 reviews.

In [86]:
print(merged.groupby(['userId']).agg({'rating':len}).reset_index().sort_values('rating'))
print("No users have less than 10 reviews")

     userId  rating
441     442    20.0
405     406    20.0
146     147    20.0
193     194    20.0
568     569    20.0
..      ...     ...
273     274  1346.0
447     448  1864.0
473     474  2108.0
598     599  2478.0
413     414  2698.0

[610 rows x 2 columns]
No users have less than 10 reviews

#### Create a correlation matrix

In [87]:
merged.corr()

          movieId    userId    rating
movieId  1.000000  0.006773 -0.004061
userId   0.006773  1.000000 -0.049348
rating  -0.004061 -0.049348  1.000000